-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Jul 03, 2025 at 08:56 AM
-- Server version: 10.11.11-MariaDB-0+deb12u1-log
-- PHP Version: 8.4.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `charoen_new`
--

-- --------------------------------------------------------

--
-- Dumping data for table `provinces`
--

INSERT INTO `provinces` (`id`, `province_name`, `province_code`, `created_at`, `updated_at`) VALUES
(1, 'กรุงเทพมหานคร', 10, NOW(), NOW()),
(2, 'สมุทรปราการ', 11, NOW(), NOW()),
(3, 'นนทบุรี', 12, NOW(), NOW()),
(4, 'ปทุมธานี', 13, NOW(), NOW()),
(5, 'พระนครศรีอยุธยา', 14, NOW(), NOW()),
(6, 'อ่างทอง', 15, NOW(), NOW()),
(7, 'ลพบุรี', 16, NOW(), NOW()),
(8, 'สิงห์บุรี', 17, NOW(), NOW()),
(9, 'ชัยนาท', 18, NOW(), NOW()),
(10, 'สระบุรี', 19, NOW(), NOW()),
(11, 'ชลบุรี', 20, NOW(), NOW()),
(12, 'ระยอง', 21, NOW(), NOW()),
(13, 'จันทบุรี', 22, NOW(), NOW()),
(14, 'ตราด', 23, NOW(), NOW()),
(15, 'ฉะเชิงเทรา', 24, NOW(), NOW()),
(16, 'ปราจีนบุรี', 25, NOW(), NOW()),
(17, 'นครนายก', 26, NOW(), NOW()),
(18, 'สระแก้ว', 27, NOW(), NOW()),
(19, 'นครราชสีมา', 30, NOW(), NOW()),
(20, 'บุรีรัมย์', 31, NOW(), NOW()),
(21, 'สุรินทร์', 32, NOW(), NOW()),
(22, 'ศรีสะเกษ', 33, NOW(), NOW()),
(23, 'อุบลราชธานี', 34, NOW(), NOW()),
(24, 'ยโสธร', 35, NOW(), NOW()),
(25, 'ชัยภูมิ', 36, NOW(), NOW()),
(26, 'อำนาจเจริญ', 37, NOW(), NOW()),
(27, 'หนองบัวลำภู', 39, NOW(), NOW()),
(28, 'ขอนแก่น', 40, NOW(), NOW()),
(29, 'อุดรธานี', 41, NOW(), NOW()),
(30, 'เลย', 42, NOW(), NOW()),
(31, 'หนองคาย', 43, NOW(), NOW()),
(32, 'มหาสารคาม', 44, NOW(), NOW()),
(33, 'ร้อยเอ็ด', 45, NOW(), NOW()),
(34, 'กาฬสินธุ์', 46, NOW(), NOW()),
(35, 'สกลนคร', 47, NOW(), NOW()),
(36, 'นครพนม', 48, NOW(), NOW()),
(37, 'มุกดาหาร', 49, NOW(), NOW()),
(38, 'เชียงใหม่', 50, NOW(), NOW()),
(39, 'ลำพูน', 51, NOW(), NOW()),
(40, 'ลำปาง', 52, NOW(), NOW()),
(41, 'อุตรดิตถ์', 53, NOW(), NOW()),
(42, 'แพร่', 54, NOW(), NOW()),
(43, 'น่าน', 55, NOW(), NOW()),
(44, 'พะเยา', 56, NOW(), NOW()),
(45, 'เชียงราย', 57, NOW(), NOW()),
(46, 'แม่ฮ่องสอน', 58, NOW(), NOW()),
(47, 'นครสวรรค์', 60, NOW(), NOW()),
(48, 'อุทัยธานี', 61, NOW(), NOW()),
(49, 'กำแพงเพชร', 62, NOW(), NOW()),
(50, 'ตาก', 63, NOW(), NOW()),
(51, 'สุโขทัย', 64, NOW(), NOW()),
(52, 'พิษณุโลก', 65, NOW(), NOW()),
(53, 'พิจิตร', 66, NOW(), NOW()),
(54, 'เพชรบูรณ์', 67, NOW(), NOW()),
(55, 'ราชบุรี', 70, NOW(), NOW()),
(56, 'กาญจนบุรี', 71, NOW(), NOW()),
(57, 'สุพรรณบุรี', 72, NOW(), NOW()),
(58, 'นครปฐม', 73, NOW(), NOW()),
(59, 'สมุทรสาคร', 74, NOW(), NOW()),
(60, 'สมุทรสงคราม', 75, NOW(), NOW()),
(61, 'เพชรบุรี', 76, NOW(), NOW()),
(62, 'ประจวบคีรีขันธ์', 77, NOW(), NOW()),
(63, 'นครศรีธรรมราช', 80, NOW(), NOW()),
(64, 'กระบี่', 81, NOW(), NOW()),
(65, 'พังงา', 82, NOW(), NOW()),
(66, 'ภูเก็ต', 83, NOW(), NOW()),
(67, 'สุราษฎร์ธานี', 84, NOW(), NOW()),
(68, 'ระนอง', 85, NOW(), NOW()),
(69, 'ชุมพร', 86, NOW(), NOW()),
(70, 'สงขลา', 90, NOW(), NOW()),
(71, 'สตูล', 91, NOW(), NOW()),
(72, 'ตรัง', 92, NOW(), NOW()),
(73, 'พัทลุง', 93, NOW(), NOW()),
(74, 'ปัตตานี', 94, NOW(), NOW()),
(75, 'ยะลา', 95, NOW(), NOW()),
(76, 'นราธิวาส', 96, NOW(), NOW()),
(77, 'บึงกาฬ', 97, NOW(), NOW());

COMMIT;
